Documents/fredonia/tally-ho/web/todo-hw/app/controllers/dashboard_controller.rb

  def example_new
    new_course = Course.new
    new_course.name = 'Some Class'
    new_course.number = 1
    new_course.save
---
INSERT INTO "courses" ("name", "number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Some Class"], ["number", 1], ["created_at", 2016-09-26 23:57:15 UTC], ["updated_at", 2016-09-26 23:57:15 UTC]]

  def create_counter

    counter = Counter.new
    counter.users_id = params[:users_id]
    counter.courses_id = params[:courses_id]
    if !counter.save
      render json: "Could not Save", status: 400
    end

    counts = Counter.where(courses_id: params[:courses_id])
---
INSERT INTO "counters" ("courses_id", "users_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["courses_id", 1], ["users_id", 1], ["created_at", 2016-09-28 23:33:18 UTC], ["updated_at", 2016-09-28 23:33:18 UTC]]
SELECT "counters".* FROM "counters" WHERE "counters"."courses_id" = ?  [["courses_id", 1]]

  def delete_course
    course_to_delete = Course.find(params[:id])
    course_to_delete.destroy
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 2]]